#include "global.h"


/*-----------------------------------------------------------
* 函数：void Init_IO()
* 功能：IO口初始化函数
* 输入： 无
* 输出： 无
------------------------------------------------------------*/
void Init_IO()
{
	/*
	P00USB插入检测                       输入禁上拉
	P01接按键KEY1                        上拉输入
	P02接LED1，LED共阳极                 输出高
	P03接按键KEY3                        输出高
	P04接按键KEY2                        输出高
	P05接ADC—MTCTR2，测转动电机工作电流  模拟输入
	P06接ADC-M2，测转动电机工作电压      模拟输入
	P07接NTC，测温                       模拟输入
	*/
	P0M = 0x1c;  //0001 1100
	P0UR = 0x1a; //0001 1010
  P0 = 0x1c;   //0001 1100   
	
	/*
	P10接PWM1NB，转动电机驱动口B         输出低
	P11接PWM1NA，转动电机驱动口A         输出低
	P12接ADC-MTCTR，测振动电机工作电流   模拟输入
	P13接PWM—charge充电控制口            输出低
	P14接ADC-3.7V测电池电压              模拟输入
	P15接PWN-MTCTR振动电机驱动口         输出低
	P16接Detect-6v测USB输入电压          模拟输入
	P17接ADC-CHARGEC测充电电流           模拟输入
	*/
	P1M = 0x2b;  //0010 1011
	P1UR = 0x00; //0000 0000
	P1 = 0x00;   //0000 0000
	
	/*
	P20接VCC-NTC给NTC供电                输出高
	P21接ADC-M1测振动马达电压            模拟输入
	*/
	P2M = 0x01;  //0000 0001
	P2UR = 0x00; //0000 0000
	P2 = 0x01;   //0000 0001
}	


/*-----------------------------------------------------------
* 函数：void Init_Time0()
* 功能：T0初始化函数
* 输入： 无
* 输出： 无
------------------------------------------------------------*/
void Init_Time0()
{
  TH0 = 0xf8;    //延时2ms
	TL0 = 0x30;
	TMOD = 0x05;   //模式1，Fosc分频作为时钟源
	TCON0 = 0x20;  //Fosc32分频
	TR0 = 1;       //打开计时器 
	ET0 = 1;       //开计时器0中断
}


/*-----------------------------------------------------------
* 函数：void Init_Time0()
* 功能：T0初始化函数
* 输入： 无
* 输出： 无
------------------------------------------------------------*/
void Init_PWM()
{
	PW1CH = 0x04;  //0000 0100 
	               //P15做PWM输出口	
	PW1M = 0x60;   //0110 0000
	               //Fosc/2做时钟源	
  PW1YH = 0x03;  //设置PWM1周期 20K
	PW1YL = 0x20;
	PW12DH = 0x01; //设置PWM1占空比 50%
	PW12DL = 0x90;

	
	PW2CH = 0x34;  //0011 0100
	               //P10 P11 P13做PWM输出口
	PW2M = 0x61;   //0110 0001
	               //Fosc/2做时钟源	
  PW2YH = 0x03;  //设置PWM2周期 15.6K
	PW2YL = 0xff;
	PW2DH = 0x00;  //设置PWM2占空比 50%
	PW2DL = 0x00;
}

/*-----------------------------------------------------------
* 函数：void Init_ADC()
* 功能：ADC初始化函数
* 输入： 无
* 输出： 无
------------------------------------------------------------*/
void Init_ADC()
{
	P0CON = 0xe0;       //1110 0000  P05、P06、P07做纯模拟输入
	P1CON = 0xd4;       //1101 0100  P12、P14、P16、P17做纯模拟输入     
	P2CON = 0x02;       //0000 0010  P21做纯模拟输入

	VREFH = 0x00;       //0000 0000  内部参考电压
	ADR = 0x40;         //0100 0000  端口使能 ADC时钟fosc分频
	ADCAL = 0x07;       //0000 0111  ADC时钟fosc/128	
  ADM = 0x80;         //1000 0000  AD转换使能
	nop_();
	nop_();
	nop_();
	nop_();
	nop_();
	ADCAL |= 0x80;      //开始校准
	while(ADCAL&0x80);
	ADCAL |= 0x40;
}
